#include <gtk/gtk.h>
#include <glib.h>
#include <glib/gprintf.h>
#include <string.h>
#include <stdlib.h>

/****************************************************************** LOAD CSS */
static void load_css(void)
{
    GtkCssProvider *provider;
    GdkDisplay *display;
    GdkScreen *screen;
    const gchar *css_style_file = "style.css";
    GFile *css_fp = g_file_new_for_path(css_style_file);
    GError *error = 0;
    provider = gtk_css_provider_new();
    display = gdk_display_get_default();
    screen = gdk_display_get_default_screen(display);
    gtk_style_context_add_provider_for_screen(screen, GTK_STYLE_PROVIDER(provider), GTK_STYLE_PROVIDER_PRIORITY_APPLICATION);
    gtk_css_provider_load_from_file(provider, css_fp, &error);
    g_object_unref(provider);
}

/****************************************************************** TYPEDEF *

/*Sign in*/
typedef struct
{
    int id;
    char* name;
    int supplier;
    int price;
    double discount;
    int quantity;
} Product;

typedef struct
{
    gint id;
    gchar *email;
    gchar *pwd;
    gchar *firstName;
    gchar *lastName;
    gchar *address;
    gint type;
    gint tikuCoin;
    gint dob;
    gint mob;
    gint yob;
} Customer;

typedef struct
{
    GtkWidget *greeterlabel;
    GtkWidget *maillabel;
    GtkWidget *mailentry;
    GtkWidget *pwdlabel;
    GtkWidget *pwdentry;
    GtkWidget *enterbutton;
    GtkWidget *clearbutton;
} appWidgets;

/*Sign up*/
typedef struct
{
    GtkWidget *tmpEntry;
    GtkWidget *fnameEntry;
    GtkWidget *gnameEntry;
    GtkWidget *cityEntry;
    GtkWidget *byearSpin;
    GtkWidget *bmonthSpin;
    GtkWidget *bdaySpin;
} signUp_diaWidgets;

typedef struct
{
    GtkApplication *app;
    GtkWidget *window;
    GtkWidget *img;
    signUp_diaWidgets *d;
} signUp_appWidgets;

/****************************************************************** WINDOWS */
/*01*/ static GtkWidget *openWindow;
/*02*/ static GtkWidget *signInWindow;
/*03*/ static GtkWidget *customerMapWindow;
/*04*/ static GtkWidget *changePwdWindow;
/*05*/ static GtkWidget *changeInformationWindow;
/*06*/ static GtkWidget *notiWindow;
/*07*/ static GtkWidget *signUpWindow;
/*08*/ static GtkWidget *showProductsWindow;
/*09*/ static GtkWidget *supplierMapWindow;
/*10*/ static GtkWidget *showInforWindow;
/*11*/ static GtkWidget *paymentWindow;


/****************************************************************** GLOBAL VARIABLES */
static gint noCloseWindow = 1000;
static gint noOpenWindow = 1000;
/*Show products*/
Product databaseProducts[500];
int showedProducts[500];
int itemList[500];
static int firstIndex = 0;
GtkWidget *product1, *product2, *product3, *product4, *product5, *product6, *product7, *product8, *product9, *product10;
GtkWidget *id1, *id2, *id3, *id4, *id5, *id6, *id7, *id8, *id9, *id10;
GtkWidget *img1, *img2, *img3, *img4, *img5, *img6, *img7, *img8, *img9, *img10; //img gio hang
GtkWidget *price1, *price2, *price3, *price4, *price5, *price6, *price7, *price8, *price9, *price10;
char* itemListText;
GtkTextBuffer *buffer;
GtkWidget *idDelEntry;
/*Sign in*/

static Customer customer;
static int numberOfCustomers;
static int numberOfProducts;
static int numberOfItem;

/*Sign up*/
static Customer newAccount;
